Revit 2026 API
EnergyAnalysisDetailModelOptions.EnergyModelType Property
 It indicates whether the energy model is based on rooms/spaces or building elements.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public EnergyModelType EnergyModelType { get; set; }
Public Property EnergyModelType As EnergyModelType
	Get
	Set
public:
property EnergyModelType EnergyModelType {
	EnergyModelType get ();
	void set (EnergyModelType value);
}
member EnergyModelType : EnergyModelType with get, set
Property Value
EnergyModelType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default value is EnergyModelType::SpatialElement.
See Also
Reference
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace